using System;

class Program
{
static void Main()
    {
        int[,] graph1 = 
        {
            {0, 2, 4, 8, 0}, 
            {2, 0, 5, 0, 5}, 
            {4, 5, 0, 0, 0}, 
            {8, 0, 0, 0, 0}, 
            {0, 5, 0, 0, 0} 
        };

        int[,] graph2 =
        {
            {0, 5, 2, 0, 0 },
            {5, 0, 3, 0, 0 },
            {2, 3, 0, 10, 12},
            {0, 0, 10, 0, 6 },
            {0, 0, 12, 6, 0 }
        };

        int[,] graph3 = 
        {
            {0, 5, 2, 0, 10, 7}, 
            {5, 0, 3, 0, 0, 9},
            {2, 3, 0, 10, 12, 0},
            {0, 0, 10, 0, 6, 24},
            {10, 0, 12, 6, 0, 3}, 
            {7, 9, 0, 24, 3, 0}
        };

        int[,] graph4 = 
        {
            {0, 5, 2, 0, 10, 7, 4, 0, 0, 0 },
            {5, 0, 3, 0, 0, 9, 0, 0, 0, 0    },
            {2, 3, 0, 10, 12, 0, 2, 0, 0, 0 },
            {0, 0, 10, 0, 6, 24, 0, 0, 11, 0 },
            {10, 0, 12, 6, 0, 3, 0, 0, 0, 0 },
            {7, 9, 0, 24, 3, 0, 0, 3, 2, 2 },
            {4, 0, 2, 0, 0, 0, 0, 21, 0, 0 },
            {0, 0, 0, 0, 0, 3, 21, 0, 0, 0 },
            {0, 0, 0, 11, 0, 2, 0, 0, 0, 0 },
            {0, 0, 0, 0, 0, 2, 0, 0, 0, 0 },
        };

        Console.WriteLine($"Краскал: Вес минимального остовного дерева 1 = {Algorithms.Kruskal(graph1)}");
        Console.WriteLine($"Краскал: Вес минимального остовного дерева 2 = {Algorithms.Kruskal(graph2)}");
        Console.WriteLine($"Краскал: Вес минимального остовного дерева 3 = {Algorithms.Kruskal(graph3)}");
        Console.WriteLine($"Краскал: Вес минимального остовного дерева 4 = {Algorithms.Kruskal(graph4)}");

        Console.WriteLine($"Прима: Вес минимального остовного дерева 1 = {Algorithms.Prima(graph1)}");
        Console.WriteLine($"Прима: Вес минимального остовного дерева 2 = {Algorithms.Prima(graph2)}");
        Console.WriteLine($"Прима: Вес минимального остовного дерева 3 = {Algorithms.Prima(graph3)}");
        Console.WriteLine($"Прима: Вес минимального остовного дерева 4 = {Algorithms.Prima(graph4)}");
    }
}